
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		УстановитьПараметрыФО(Объект.Дата);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыФО(ДатаДокумента)
	ПараметрыОпций = Новый Структура("Период, Пользователь", ДатаДокумента, ПараметрыСеанса.ТекущийПользователь);
	
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыОпций);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьПараметрыФО(Объект.Дата);
КонецПроцедуры
