
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Проводки 
	Движения.Проводки.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт			 = ПланыСчетов.Управленческий.Товары;
		Движение.СчетКт			 = ПланыСчетов.Управленческий.Поставщики;
		Движение.Период			 = Дата;
		Движение.Сумма			 = ТекСтрокаТовары.Сумма;
		Движение.КоличествоДт	 = ТекСтрокаТовары.Количество;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ТекСтрокаТовары.Номенклатура;
	КонецЦикла;
КонецПроцедуры
