
Процедура ЗаполнитьНаборЗаписей(ТекстЗапроса, Ссылка, НаборЗаписей) Экспорт
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Командировка Тогда
			КоличествоМесяцев = Выборка.КоличествоМесяцев;
			Для Месяц = 0 По КоличествоМесяцев Цикл
				Движение = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Выборка);
				
				НачалоМесяца = ДобавитьМесяц(НачалоМесяца(Выборка.ПериодДействия), Месяц);
				Движение.ПериодДействияНачало = Макс(Выборка.ПериодДействияНачало, НачалоМесяца);
				Движение.ПериодДействияКонец = Мин(Выборка.ПериодДействияКонец, КонецМесяца(НачалоМесяца));
			КонецЦикла;
		Иначе
			Движение = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура РассчитатьЗаписиРегистраРасчета(НаборЗаписей, Выборка) Экспорт
	Пока Выборка.Следующий() Цикл
		Запись = НаборЗаписей[Выборка.НомерСтроки-1];
		
		Результат = 0;
		
		Запись.Результат = Результат;
	КонецЦикла;
КонецПроцедуры
