
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		// регистр ОстаткиНоменклатуры Приход
		Движение = Движения.ОстаткиНоменклатуры.ДобавитьПриход();
		Движение.Период			 = Дата;
		Движение.Номенклатура	 = ТекСтрокаТовары.Номенклатура;
		Движение.Склад			 = Склад;
		Движение.Партия			 = Ссылка;
		Движение.Количество		 = ТекСтрокаТовары.Количество;
		Движение.Стоимость		 = ТекСтрокаТовары.Сумма;
	КонецЦикла;
КонецПроцедуры
