Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни) Экспорт 
	
	Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.График.Установить(График);
	Набор.Очистить();
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	Для к = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[к];
		Если Запись.Дата < ДатаНачала Тогда
		    Продолжить;
		ИначеЕсли Запись.Дата = Дат Тогда
			Запись.ЗначениеЧасы	 = ?(Найти(ВыходныеДни, Строка(ДеньНедели(Дат))), 0, 8);
			Запись.ЗначениеДни	 = ?(Найти(ВыходныеДни, Строка(ДеньНедели(Дат))), 0, 1);
			Дат = Дат + ЧислоСекундВСутках;
		Иначе
			Пока Дат < Мин(Запись.Дата, ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.Дата		 = Дат;
				НоваяЗапись.ЗначениеЧасы = ?(Найти(ВыходныеДни, Строка(ДеньНедели(Дат))), 0, 8);
				Запись.ЗначениеДни		 = ?(Найти(ВыходныеДни, Строка(ДеньНедели(Дат))), 0, 1);
				
				Дат = Дат + ЧислоСекундВСутках;
			КонецЦикла; 
			Если Запись.Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Запись.ЗначениеЧасы	 = ?(Найти(ВыходныеДни, Строка(ДеньНедели(Дат))), 0, 8);
				Запись.ЗначениеДни	 = ?(Найти(ВыходныеДни, Строка(ДеньНедели(Дат))), 0, 1);
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		КонецЕсли; 
	КонецЦикла;
	Набор.Записать();
	
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.Дата			 = Дат;
		Запись.График		 = График;
		Запись.ЗначениеЧасы	 = ?(Найти(ВыходныеДни, Строка(ДеньНедели(Дат))), 0, 8);
		Запись.ЗначениеДни	 = ?(Найти(ВыходныеДни, Строка(ДеньНедели(Дат))), 0, 1);
		
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры
