
&НаСервере
Процедура СформироватьНаСервере()
	ДГ.Очистить();
	ДГ.Обновление				 = Ложь;
	ДГ.ОтображатьПустыеЗначения	 = Ложь;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ФактическийПериодДействия.Сотрудник КАК Сотрудник,
		|	ФактическийПериодДействия.ВидРасчета КАК ВидРасчета,
		|	ФактическийПериодДействия.ПериодДействияНачало КАК Начало,
		|	ФактическийПериодДействия.ПериодДействияКонец КАК Конец
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления.ФактическийПериодДействия(ПериодДействия МЕЖДУ &ПериодНачало И &ПериодКонец) КАК ФактическийПериодДействия");
	
	Запрос.УстановитьПараметр("ПериодНачало", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ПериодКонец", Период.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Точка	 = ДГ.УстановитьТочку(Выборка.Сотрудник);
		Серия	 = ДГ.УстановитьСерию(Выборка.ВидРасчета);
		Значение = ДГ.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало	 = Выборка.Начало;
		Интервал.Конец	 = Выборка.Конец;
	КонецЦикла;
	
	ДГ.Обновление = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
