
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокЗадач.Параметры.УстановитьЗначениеПараметра("БизнесПроцесс", Объект.Ссылка);
	
	Карта = ?(Объект.Ссылка.Пустая(),
			БизнесПроцессы.БизнесПроцесс.ПолучитьКартуМаршрута(),
			ПолучитьКарту(Объект.Ссылка));
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКарту(БП)
	Возврат БП.ПолучитьОбъект().ПолучитьКартуМаршрута();
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	СписокЗадач.Параметры.УстановитьЗначениеПараметра("БизнесПроцесс", Объект.Ссылка);
	
	Карта = ПолучитьКарту(Объект.Ссылка);
КонецПроцедуры
