
&НаСервере
Процедура ЗаполнитьНаСервере()
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СоставКомплектов.Комплектующее КАК Комплектующее,
		|	СоставКомплектов.Количество * &Количество КАК Количество
		|ИЗ
		|	РегистрСведений.СоставКомплектов КАК СоставКомплектов
		|ГДЕ
		|	СоставКомплектов.Комплект = &Комплект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Комплектующее
		|АВТОУПОРЯДОЧИВАНИЕ");
	
	Запрос.УстановитьПараметр("Комплект", Объект.Комплект);
	Запрос.УстановитьПараметр("Количество", Объект.Количество);
	
	Объект.Состав.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
