
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ЗадолженностьПоОтгрузке.Записывать = Истина;
	Движения.ЗадолженностьПоОплате.Записывать = Истина;

	// регистр ЗадолженностьПоОтгрузке Приход
	Движение = Движения.ЗадолженностьПоОтгрузке.ДобавитьПриход();
	Движение.Период	 = Дата;
	Движение.Счет	 = Ссылка;
	Движение.Сумма	 = СуммаДокумента;

	// регистр ЗадолженностьПоОплате Приход
	Движение = Движения.ЗадолженностьПоОплате.ДобавитьПриход();
	Движение.Период		 = Дата;
	Движение.Контрагент	 = Контрагент;
	Движение.Счет		 = Ссылка;
	Движение.Сумма		 = СуммаДокумента;
КонецПроцедуры
