
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("Склад", Параметры.Склад);
	ОтобранныеТовары.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресВХ));
	
	АдресВХ = Параметры.АдресВХ;
КонецПроцедуры

&НаКлиенте
Процедура ОтобранныеТоварыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Для Каждого Товар Из ПараметрыПеретаскивания.Значение Цикл
		ДобавитьТоварВКорзину(Товар);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЭлементГруппа(ВыбраннаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьТоварВКорзину(ВыбраннаяСтрока);
	
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТоварВКорзину(Товар)
	НоваяСтрока = ОтобранныеТовары.Добавить();
	НоваяСтрока.Номенклатура = Товар;
	НоваяСтрока.Количество = 1;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭлементГруппа(Товар)
	Возврат Товар.ЭтоГруппа;
КонецФункции

&НаКлиенте
Процедура ЗавершитьПодбор(Команда)
	ПоместитьТоварыВоВРеменноеХранилище();
	ВладелецФормы.ОбработатьПодбор(АдресВХ);
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПоместитьТоварыВоВРеменноеХранилище()
	ПоместитьВоВременноеХранилище(ОтобранныеТовары.Выгрузить(), АдресВХ);
КонецПроцедуры
