
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("Склад", Параметры.Склад);
КонецПроцедуры

&НаКлиенте
Процедура ОтобранныеТоварыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Для Каждого Товар Из ПараметрыПеретаскивания.Значение Цикл
		ДобавитьТоварВКорзину(Товар);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЭлементГруппа(ВыбраннаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьТоварВКорзину(ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТоварВКорзину(Товар)
	НоваяСтрока = ОтобранныеТовары.Добавить();
	НоваяСтрока.Номенклатура = Товар;
	НоваяСтрока.Количество = 1;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭлементГруппа(Товар)
	Возврат Товар.ЭтоГруппа;
КонецФункции
