
Процедура ЗаполнитьНаборЗаписей(ТекстЗапроса, Ссылка, НаборЗаписей) Экспорт
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Ссылка.ПериодРегистрации));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	КонецЦикла;
КонецПроцедуры

Процедура РассчитатьЗаписиРегистраРасчета(НаборЗаписей, Выборка) Экспорт
	ВидРасчетаОклад = ПланыВидовРасчета.ОсновныеНачисления.Оклад;
	ВидРасчетаПереработка = ПланыВидовРасчета.ДополнительныеНачисления.Переработка;
	ВидРасчетаПрогул = ПланыВидовРасчета.ДополнительныеНачисления.Прогул;
	ВидРасчетаШтраф = ПланыВидовРасчета.Удержания.Штраф;
	
	Пока Выборка.Следующий() Цикл
		Запись = НаборЗаписей[Выборка.НомерСтроки-1];
		
		Результат = 0;
		
		Если Выборка.ВидРасчета = ВидРасчетаОклад Тогда
			Результат = Выборка.Размер;
		ИначеЕсли Выборка.ВидРасчета = ВидРасчетаПереработка Тогда
			СреднечасовойОклад = ?(Выборка.ЧасовНорма = 0, 0, Выборка.База / Выборка.ЧасовНорма);
			Результат = СреднечасовойОклад * Запись.Размер;
		ИначеЕсли Выборка.ВидРасчета = ВидРасчетаПрогул Тогда
			Результат = Запись.Результат;
			Запись.Дней = Выборка.ДнейФакт;
		ИначеЕсли Выборка.ВидРасчета = ВидРасчетаШтраф Тогда
			Результат = Выборка.ДнейПрогула * Запись.Размер;
		КонецЕсли;
		
		Запись.Результат = Результат;
	КонецЦикла;
КонецПроцедуры
