
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборОсновныеНачисления = Движения.ОсновныеНачисления;
	НаборДополнительныеНачисления = Движения.ДополнительныеНачисления;
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	НачислениеЗарплаты.ПериодРегистрации КАК ПериодДействияНачало,
		|	ВЫБОР
		|		КОГДА ДЕНЬ(НачислениеЗарплаты.ПериодРегистрации) > ДЕНЬ(ДОБАВИТЬКДАТЕ(НачислениеЗарплаты.ПериодРегистрации, НЕДЕЛЯ, 1))
		|			ТОГДА КОНЕЦПЕРИОДА(НачислениеЗарплаты.ПериодРегистрации, МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НачислениеЗарплаты.ПериодРегистрации, НЕДЕЛЯ, 1), СЕКУНДА, -1)
		|	КОНЕЦ КАК ПериодДействияКонец
		|ПОМЕСТИТЬ втПериодыДействия
		|ИЗ
		|	Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
		|ГДЕ
		|	НачислениеЗарплаты.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ДЕНЬ(НачислениеЗарплаты.ПериодРегистрации) > ДЕНЬ(ДОБАВИТЬКДАТЕ(НачислениеЗарплаты.ПериодРегистрации, НЕДЕЛЯ, 1))
		|			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(НачислениеЗарплаты.ПериодРегистрации, НЕДЕЛЯ, 1), МЕСЯЦ)
		|		ИНАЧЕ НачислениеЗарплаты.ПериодРегистрации
		|	КОНЕЦ,
		|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НачислениеЗарплаты.ПериодРегистрации, НЕДЕЛЯ, 1), СЕКУНДА, -1)
		|ИЗ
		|	Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
		|ГДЕ
		|	НачислениеЗарплаты.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОсновныеНачисления.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
		|	ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ВЫБОР ОсновныеНачисления.ВидРасчета
		|		КОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.ОплатаПоТарифу)
		|			ТОГДА втПериодыДействия.ПериодДействияНачало
		|		ИНАЧЕ ОсновныеНачисления.ПериодДействияНачало
		|	КОНЕЦ КАК ПериодДействияНачало,
		|	ВЫБОР ОсновныеНачисления.ВидРасчета
		|		КОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.ОплатаПоТарифу)
		|			ТОГДА втПериодыДействия.ПериодДействияКонец
		|		ИНАЧЕ ОсновныеНачисления.ПериодДействияКонец
		|	КОНЕЦ КАК ПериодДействияКонец,
		|	ОсновныеНачисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
		|	ВЫБОР ОсновныеНачисления.БазовыйПериодКонец
		|		КОГДА ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ОсновныеНачисления.БазовыйПериодКонец
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ОсновныеНачисления.БазовыйПериодКонец, ДЕНЬ)
		|	КОНЕЦ КАК БазовыйПериодКонец,
		|	ОсновныеНачисления.Размер КАК Размер,
		|	ОсновныеНачисления.График КАК График
		|ИЗ
		|	Документ.НачислениеЗарплаты.ОсновныеНачисления КАК ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПериодыДействия КАК втПериодыДействия
		|		ПО (ОсновныеНачисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.ОплатаПоТарифу))
		|ГДЕ
		|	ОсновныеНачисления.Ссылка = &Ссылка";
	
	Расчеты.ЗаполнитьНаборЗаписей(ТекстЗапроса, Ссылка, НаборОсновныеНачисления);
	НаборОсновныеНачисления.Записать(, Ложь);
КонецПроцедуры
